a = int(input("Введите номер месяца:"))
if not(a>=1 and a<=12):
    print("В году 12 месяцев, введите число от 1 до 12")
else:
    if a == 1:
        print("Зима. Январь.")
    if a == 2:
        print("Зима. Февраль.")
    if a == 3:
        print("Весна. Март.")
    if a == 4:
        print("Весна. Апрель.")
    if a == 5:
        print("Весна. Май.")
    if a == 6:
        print("Лето. Июнь.")
    if a == 7:
        print("Лето. Июль.")
    if a == 8:
        print("Лето. Август.")
    if a == 9:
        print("Осень. Сентябрь.")
    if a == 10:
        print("Осень. Октябрь.")
    if a == 11:
        print("Осень. Ноябрь.")
    if a == 12:
        print("Зима. Декабрь.")
    